tests/tests/test-api-load.yaml
scenarios:
  api_test:
    requests:
      - url: http://api:8080/get
        method: GET
        label: "Get Post 1"

      - url: http://api:8080/post
        method: POST
        label: "Create Post"
        headers:
          Content-Type: application/json
        body:
          title: "Test Post"
          body: "This is a test post"
          userId: 1

execution:
  - concurrency: 10        # ilu użytkowników jednocześnie
    ramp-up: 5s            # czas rozkręcania
    hold-for: 1m           # czas trwania testu
    scenario: api_test

reporting:
  - module: console
  - module: final-stats
  - module: junit-xml